Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K14.tmx
Source language: en_us
Languages: zh_cn

source: A Pair Of Silk Stockings
zh_cn: 一双丝袜

source: Little Mrs. Sommers one day found herself the unexpected possessor of fifteen dollars.
zh_cn: 升斗小民萨默斯太太有一天发现自己意外地拥有了十五美元。

source: It seemed to her a very large amount of money, and the way in which it stuffed and bulged her worn old porte-monnaie gave her a feeling of importance such as she had not enjoyed for years.
zh_cn: 这对她来说似乎是非常大的一笔钱，它把她破旧的小钱包塞得满满的样子给她一种好多年没有享受过的显赫的感觉。

source: The question of investment was one that occupied her greatly.
zh_cn: 投资的问题是一件大大占据她心神的事。

source: For a day or two she walked about apparently in a dreamy state, but really absorbed in speculation and calculation.
zh_cn: 有一两天的时间，她表面上看是在梦幻的状态下四处走动，但实际上却完全陷入了思索和计算。

source: She did not wish to act hastily, to do anything she might afterward regret.
zh_cn: 她不想草率行事，不想做任何她以后可能会后悔的事。

source: But it was during the still hours of the night when she lay awake revolving plans in her mind that she seemed to see her way clearly toward a proper and judicious use of the money.
zh_cn: 不过在夜晚安静的时刻，当她躺在床上在脑子里反复思考着计划的时候，她似乎清楚地看到了正确明智地使用这笔钱的方向。

source: A dollar or two should be added to the price usually paid for Janie's shoes, which would insure their lasting an appreciable time longer than they usually did.
zh_cn: 一两美元应该加在通常买给珍妮的鞋的价格上，这样将确保它们比往常要耐穿相当长的一段时间。

source: She would buy so and so many yards of percale for new shirt waists for the boys and Janie and Mag.
zh_cn: 她要买很多很多码的高级密织棉布给男孩们和珍妮、梅格做新衬衫。

source: She had intended to make the old ones do by skilful patching.
zh_cn: 她本打算把旧衣服巧妙修补一番再凑合凑合。

source: Mag should have another gown.
zh_cn: 梅格应该再有一件外衣。

source: She had seen some beautiful patterns, veritable bargains in the shop windows.
zh_cn: 她在商店橱窗里见过一些花样好看、名副其实的便宜货。

source: And still there would be left enough for new stockings - two pairs apiece - and what darning that would save for a while! She would get caps for the boys and sailor-hats for the girls.
zh_cn: 然后还会剩下足够的钱买新袜子——每人两双——这可有段时间不用织补了！她要给男孩们买帽子，给女孩们买水手帽。

source: The vision of her little brood looking fresh and dainty and new for once in their lives excited her and made her restless and wakeful with anticipation.
zh_cn: 想象着她的孩子们一生中就这一次看起来光鲜、优雅、精神的景象，让她兴奋，让她怀着期盼难以平静、无法入眠。

source: The neighbors sometimes talked of certain "better days" that little Mrs. Sommers had known before she had ever thought of being Mrs. Sommers.
zh_cn: 邻居们有时谈起一些“更好的日子”，那是升斗小民萨默斯太太以前所熟悉的，那时她还从未有过成为萨默斯太太的想法。

source: She herself indulged in no such morbid retrospection.
zh_cn: 她自己并不沉湎于这样病态的回想之中。

source: She had no time - no second of time to devote to the past. The needs of the present absorbed her every faculty.
zh_cn: 她没有时间——没有一刻时间可用于过去。当前的需求占据了她的全部身心。

source: A vision of the future like some dim, gaunt monster sometimes appalled her, but luckily to-morrow never comes.
zh_cn: 对未来的想象像个有时让她心惊胆颤的模糊憔悴的怪物，但幸运的是明天从未来过。

source: Mrs. Sommers was one who knew the value of bargains; who could stand for hours making her way inch by inch toward the desired object that was selling below cost.
zh_cn: 萨默斯太太是一个懂得便宜货的价值的人；她能站几个小时一点一点地挪向想要的低于成本价销售的物品。

source: She could elbow her way if need be; she had learned to clutch a piece of goods and hold it and stick to it with persistence and determination till her turn came to be served, no matter when it came.
zh_cn: 如有需要，她能推搡着挤过去；她学会了抓住一件商品，坚决地、坚持不懈地拿着不放，直到轮到她接受服务，无论什么时候轮到她。

source: But that day she was a little faint and tired.
zh_cn: 但那天她有点虚弱疲惫。

source: She had swallowed a light luncheon - no! when she came to think of it, between getting the children fed and the place righted, and preparing herself for the shopping bout, she had actually forgotten to eat any luncheon at all!
zh_cn: 她吞下少量的午餐——不！当她想起来时，在照顾孩子吃饭、整理房间和自己准备去大采购之间，她居然完全忘了吃午餐！

source: She sat herself upon a revolving stool before a counter that was comparatively deserted, trying to gather strength and courage to charge through an eager multitude that was besieging breastworks of shirting and figured lawn.
zh_cn: 她在一个比较冷清的柜台前的旋转凳上坐下，试图积聚力量和勇气冲入急切的人群，他们正在围攻衬衫衣料和花细布的防护壁垒。

source: An all-gone limp feeling had come over her and she rested her hand aimlessly upon the counter.
zh_cn: 一种完全失去的无力感袭上她全身，她将手漫无目的地搁在柜台上。

source: She wore no gloves.
zh_cn: 她没戴手套。

source: By degrees she grew aware that her hand had encountered something very soothing, very pleasant to touch.
zh_cn: 渐渐地她意识到她的手碰到了一些非常抚慰人心的东西，摸起来令人非常舒适。

source: She looked down to see that her hand lay upon a pile of silk stockings.
zh_cn: 她低头看到她的手放在一堆丝袜上。

source: A placard near by announced that they had been reduced in price from two dollars and fifty cents to one dollar and ninety-eight cents; and a young girl who stood behind the counter asked her if she wished to examine their line of silk hosiery.
zh_cn: 旁边的一个布告牌上宣布它们的价格由2美元50美分降到了1美元98美分；一个站在柜台后面的年轻女孩问她要不要看看他们的丝袜类产品。

source: She smiled, just as if she had been asked to inspect a tiara of diamonds with the ultimate view of purchasing it.
zh_cn: 她微笑着，就好像她被请求怀着最终购买的目的检查一顶钻石王冠。

source: But she went on feeling the soft, sheeny luxurious things - with both hands now, holding them up to see them glisten, and to feel them glide serpent-like through her fingers.
zh_cn: 但她继续触摸那柔软的、光亮的奢侈品——现在是用两只手了，把它们拿起来看它们闪耀着光，感觉它们像蛇一样在她指间滑动。

source: Two hectic blotches came suddenly into her pale cheeks.
zh_cn: 两团红晕突然涌上她苍白的脸颊。

source: She looked up at the girl.
zh_cn: 她抬头看那个女孩。

source: "Do you think there are any eights-and-a-half among these?"
zh_cn: “你说这里面有没有8码半的？”

source: There were any number of eights-and-a-half.
zh_cn: 有很多8码半的。

source: In fact, there were more of that size than any other.
zh_cn: 事实上，这个尺码比其他任何尺码的都多。

source: Here was a light-blue pair; there were some lavender, some all black and various shades of tan and gray.
zh_cn: 有一双淡蓝色的；有一些淡紫色的，一些全黑色的，和各种深深浅浅的褐色和灰色。

source: Mrs. Sommers selected a black pair and looked at them very long and closely.
zh_cn: 萨默斯太太选了一双黑色的，长时间地、仔细地打量着它们。

source: She pretended to be examining their texture, which the clerk assured her was excellent.
zh_cn: 她假装检查它们的质地，对此店员向她保证是极好的。

source: "A dollar and ninety-eight cents," she mused aloud. "Well, I'll take this pair." She handed the girl a five-dollar bill and waited for her change and for her parcel.
zh_cn: “1美元98美分，”她若有所思地说，“好吧，我要买这双。”她递给那个女孩一张5美元的钞票，然后等她找回的零钱和包裹。

source: What a very small parcel it was! It seemed lost in the depths of her shabby old shopping-bag.
zh_cn: 多小的包裹啊！放进她破旧的购物袋的深处好像就找不着了。

source: Mrs. Sommers after that did not move in the direction of the bargain counter.
zh_cn: 在这之后萨默斯太太并没有朝廉价品柜台的方向走去。

source: She took the elevator, which carried her to an upper floor into the region of the ladies' waiting-rooms.
zh_cn: 她乘上电梯，电梯载她到上面的一个楼层进入女士休息区。

source: Here, in a retired corner, she exchanged her cotton stockings for the new silk ones which she had just bought.
zh_cn: 在这里，在一个僻静的角落里，她用刚买的新丝袜换下她的棉袜。

source: She was not going through any acute mental process or reasoning with herself, nor was she striving to explain to her satisfaction the motive of her action.
zh_cn: 她没有经历任何激烈的心理过程或者与自己争辩，她也没有为让自己满意而力图解释自己行为的动机。

source: She was not thinking at all.
zh_cn: 她根本就没思考。

source: She seemed for the time to be taking a rest from that laborious and fatiguing function and to have abandoned herself to some mechanical impulse that directed her actions and freed her of responsibility.
zh_cn: 此时她仿佛是在辛苦劳累的职责中休息一下，将自己放任给某种机械的冲动，这种冲动指导了她的行动，将她从责任中解放出来。

source: How good was the touch of the raw silk to her flesh! She felt like lying back in the cushioned chair and reveling for a while in the luxury of it.
zh_cn: 生丝轻触肌肤的感觉真好啊！她感觉好像躺在铺着软垫的椅子上，在它的奢华中陶醉了一会儿。

source: She did for a little while.
zh_cn: 她确实陶醉了一小会儿。

source: Then she replaced her shoes, rolled the cotton stockings together and thrust them into her bag.
zh_cn: 然后她穿回她的鞋子，把棉袜卷起来塞进她的包里。

source: After doing this she crossed straight over to the shoe department and took her seat to be fitted.
zh_cn: 做完这些后，她直接过去到售鞋部，坐下试穿。

source: She was fastidious.
zh_cn: 她很挑剔。

source: The clerk could not make her out; he could not reconcile her shoes with her stockings, and she was not too easily pleased.
zh_cn: 店员应付不了她；他无法让她的鞋配上她的袜子，她不太容易取悦。

source: She held back her skirts and turned her feet one way and her head another way as she glanced down at the polished, pointed-tipped boots.
zh_cn: 在她低头瞥向光亮的尖头靴子时，她提起裙子，把脚转向一边，把头转向另一边。

source: Her foot and ankle looked very pretty. She could not realize that they belonged to her and were a part of herself.
zh_cn: 她的脚和脚腕看起来非常漂亮，她没有意识到它们属于她，是她的一部分。

source: She wanted an excellent and stylish fit, she told the young fellow who served her, and she did not mind the difference of a dollar or two more in the price so long as she got what she desired.
zh_cn: 她想要一双最好的、时髦的、合适的鞋，她告诉招待她的那个年轻人，而且她不在乎价格上多一两美元的差别，只要她得到她想要的。

source: It was a long time since Mrs. Sommers had been fitted with gloves.
zh_cn: 萨默斯太太有很长时间没有戴过合适的手套了。

source: On rare occasions when she had bought a pair they were always "bargains," so cheap that it would have been preposterous and unreasonable to have expected them to be fitted to the hand.
zh_cn: 在极少的情况下她买上一副，还都是“便宜货”，太便宜了，要指望它们合手是荒谬且不切实际的。

source: Now she rested her elbow on the cushion of the glove counter, and a pretty, pleasant young creature, delicate and deft of touch, drew a long-wristed "kid" over Mrs. Sommers's hand.
zh_cn: 现在她的胳膊肘放在手套柜台的垫子上，一个漂亮的、讨人喜欢的年轻人，动作优雅灵巧，将一只长腕的“小山羊革”拉上萨默斯太太的手。

source: She smoothed it down over the wrist and buttoned it neatly, and both lost themselves for a second or two in admiring contemplation of the little symmetrical gloved hand.
zh_cn: 她将它平整地拉到手腕上，整洁地扣上钮扣，两个人有一两秒钟的时间沉浸在赞赏地注视那只小小的、匀称的、戴着手套的手。

source: But there were other places where money might be spent.
zh_cn: 但还有其他地方可能要花钱。

source: There were books and magazines piled up in the window of a stall a few paces down the street.
zh_cn: 沿街几步远的一家书报亭的橱窗里堆着书和杂志。

source: Mrs. Sommers bought two high-priced magazines such as she had been accustomed to read in the days when she had been accustomed to other pleasant things.
zh_cn: 萨默斯太太买了两本昂贵的杂志，在她习惯其他舒适物品的时期，她习惯读这样的杂志。

source: She carried them without wrapping.
zh_cn: 她拿着它们，没有包装。

source: As well as she could she lifted her skirts at the crossings.
zh_cn: 在交叉路口她尽可能地提起裙子。

source: Her stockings and boots and well fitting gloves had worked marvels in her bearing - had given her a feeling of assurance, a sense of belonging to the well-dressed multitude.
zh_cn: 她的袜子和靴子以及非常合适的手套在她的举止上创造了奇迹——给了她一种自信的感觉，一种属于衣着考究的人的感觉。

source: She was very hungry.
zh_cn: 她很饿。

source: Another time she would have stilled the cravings for food until reaching her own home, where she would have brewed herself a cup of tea and taken a snack of anything that was available.
zh_cn: 又一次她本可以平息对食物的渴望直到到达自己的家，在家里她可以泡一杯茶，吃一点现有的任何零食。

source: But the impulse that was guiding her would not suffer her to entertain any such thought.
zh_cn: 但是支配她的冲动不会允许她接受这样的想法。

source: There was a restaurant at the corner.
zh_cn: 在角落里有一家餐馆。

source: She had never entered its doors; from the outside she had sometimes caught glimpses of spotless damask and shining crystal, and soft-stepping waiters serving people of fashion.
zh_cn: 她从未进过它的大门；从外面她有时瞥见过洁净华美的亚麻桌布和亮闪闪的水晶饰品，还有步履轻柔的侍者招待上流社会的人们。

source: When she entered her appearance created no surprise, no consternation, as she had half feared it might.
zh_cn: 她进去时，她的出现没有像她有些担心的那样引起惊讶、惊愕。

source: She seated herself at a small table alone, and an attentive waiter at once approached to take her order.
zh_cn: 她在一个远离他人的小桌子旁坐下，一个殷勤的侍者立即走来请她点菜。

source: She did not want a profusion; she craved a nice and tasty bite - a half dozen blue-points, a plump chop with cress, a something sweet - a creme-frappee, for instance; a glass of Rhine wine, and after all a small cup of black coffee.
zh_cn: 她不想挥霍；她想要一餐精致可口的饭食——半打蓝点牡蛎、一块肥美的水芹肉排、一份甜点——比如一份果汁奶油冻；一杯莱茵白葡萄酒，最后再来一小杯黑咖啡。

source: While waiting to be served she removed her gloves very leisurely and laid them beside her.
zh_cn: 在等着上菜时，她非常从容地脱下手套，放在身旁。

source: Then she picked up a magazine and glanced through it, cutting the pages with a blunt edge of her knife.
zh_cn: 然后她拿起一本杂志浏览，用餐刀钝的一边裁开纸页（译注：此篇小说大约写于十九世纪末，当时的书刊杂志是未经裁开的，即所谓的毛边书）。

source: It was all very agreeable.
zh_cn: 非常惬意。

source: The damask was even more spotless than it had seemed through the window, and the crystal more sparkling.
zh_cn: 华美的亚麻桌布甚至比透过窗户看起来还要洁净，水晶饰品也更闪亮。

source: There were quiet ladies and gentlemen, who did not notice her, lunching at the small tables like her own.
zh_cn: 有安静的女士先生像她自己一样在小桌旁吃午餐，他们没有注意到她。

source: A soft, pleasing strain of music could be heard, and a gentle breeze, was blowing through the window.
zh_cn: 可以听到一曲轻柔愉悦的音乐，一阵微风穿过窗户轻轻地吹着。

source: She tasted a bite, and she read a word or two, and she sipped the amber wine and wiggled her toes in the silk stockings.
zh_cn: 她尝一口，读一两个字，她啜饮琥珀色的葡萄酒，在丝袜里扭动她的脚趾。

source: The price of it made no difference.
zh_cn: 价钱无关紧要。

source: She counted the money out to the waiter and left an extra coin on his tray, whereupon he bowed before her as before a princess of royal blood.
zh_cn: 她给侍者数出钱，并在他的托盘上额外留下一枚硬币，随之他在她面前鞠躬，就像在一个有皇家血统的公主面前一样。

source: There was still money in her purse, and her next temptation presented itself in the shape of a matinee poster.
zh_cn: 她钱包里还有钱，她的下一个诱惑以一张日场戏剧海报的形式出现了。

source: It was a little later when she entered the theatre, the play had begun and the house seemed to her to be packed.
zh_cn: 她进入剧场时有点晚了，演出已经开始了，在她看来好像坐满了人。

source: But there were vacant seats here and there, and into one of them she was ushered, between brilliantly dressed women who had gone there to kill time and eat candy and display their gaudy attire.
zh_cn: 但是到处都有空位子，她被引领到其中一个，在衣着鲜亮的女人之间，她们到这里来消磨时间、吃糖果、展示她们艳俗的服装。

source: There were many others who were there solely for the play and acting.
zh_cn: 还有很多其他人，他们在这里完全是为了看演出和表演。

source: It is safe to say there was no one present who bore quite the attitude which Mrs. Sommers did to her surroundings.
zh_cn: 可以肯定地说在场没有一个人完全持有萨默斯太太对她周围事物的看法。

source: She gathered in the whole - stage and players and people in one wide impression, and absorbed it and enjoyed it.
zh_cn: 她尽量全都收集进来——在一个广泛印象里的舞台、演员和人们，为之着迷，享受它的乐趣。

source: She laughed at the comedy and wept - she and the gaudy woman next to her wept over the tragedy.
zh_cn: 她看了喜剧笑，她和她旁边艳俗的女人看了悲剧哭。

source: And they talked a little together over it.
zh_cn: 然后她们还一起对此讨论了一会儿。

source: And the gaudy woman wiped her eyes and sniffled on a tiny square of filmy, perfumed lace and passed little Mrs. Sommers her box of candy.
zh_cn: 那个艳俗的女人用一块小小的、洒了香水的方形薄纱蕾丝擦眼睛、擤鼻涕，还把她的糖果盒递给升斗小民萨默斯太太。

source: The play was over, the music ceased, the crowd filed out.
zh_cn: 演出结束了，音乐停了，人群鱼贯而出。

source: It was like a dream ended.
zh_cn: 仿佛是一场梦结束了。

source: People scattered in all directions.
zh_cn: 人们向四处散去。

source: Mrs. Sommers went to the corner and waited for the cable car.
zh_cn: 萨默斯太太走向角落等电缆车。

source: A man with keen eyes, who sat opposite to her, seemed to like the study of her small, pale face.
zh_cn: 一个有着敏锐眼睛的男人坐在她对面，好像喜欢研究她小而苍白的脸。

source: It puzzled him to decipher what he saw there.
zh_cn: 要解释在那上面看出了什么可难倒了他。

source: In truth, he saw nothing-unless he were wizard enough to detect a poignant wish, a powerful longing that the cable car would never stop anywhere, but go on and on with her forever.
zh_cn: 事实上，他什么也没看到——除非他足够聪明能洞察一个强烈的愿望、一个巨大的渴望：电缆车永远不要在任何地方停下来，要载着她永远行驶下去。
